
## Plan Result (prod)




<pre><code>Plan: 9 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql_flexible_restore.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_database.pg_databases[&#34;toffee&#34;]
  * module.postgresql_flexible_restore.azurerm_resource_group.rg[0]
  * module.postgresql_flexible_restore.null_resource.set-user-permissions-additionaldbs[&#34;toffee&#34;]
  * module.postgresql_flexible_restore.random_password.password
  * module.postgresql_flexible_restore.terraform_data.trigger_password_reset


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_flexible_restore.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "PointInTimeRestore"
      + delegated_subnet_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "toffee-v14-flexible-restore-prod"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "toffee-v14-flexible-restore-data-prod"
      + sku_name                      = "GP_Standard_D2s_v3"
      + source_server_id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/toffee-v14-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/toffee-v14-flexible-prod"
      + storage_mb                    = 65536
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Platform Operations"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + principal_name      = "DTS Platform Operations SC"
      + principal_type      = "Group"
      + resource_group_name = "toffee-v14-flexible-restore-data-prod"
      + server_name         = "toffee-v14-flexible-restore-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "toffee-v14-flexible-restore-data-prod"
      + server_name         = "toffee-v14-flexible-restore-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible_restore.azurerm_postgresql_flexible_server_database.pg_databases["toffee"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "toffee"
      + server_id = (known after apply)
    }

  # module.postgresql_flexible_restore.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "toffee-v14-flexible-restore-data-prod"
      + tags     = {
          + "application"         = "core"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-recipes-service.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "production"
          + "managedBy"           = "Platform Operations"
        }
    }

  # module.postgresql_flexible_restore.null_resource.set-user-permissions-additionaldbs["toffee"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS JIT Access toffee DB Reader SC"
          + "force_trigger"  = null
          + "name"           = "toffee-v14-flexible-restore"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.postgresql_flexible_restore.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.postgresql_flexible_restore.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":633,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->